tutorials/VOF/variableTau/twoChannels/no_movement/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

x_min 0.3e-3;
x_max 2.7e-3;
y_min 0.3e-3;
y_max 0.7e-3;
z_min 0;
z_max 1.0;

actions
(
    {
        name    boxCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ($x_min $y_min $z_min) ($x_max $y_max $z_max);
        }
    }
    // {
    //     name    cylinderCells;
    //     type    cellSet;
    //     action  add;
    //     source  cylinderToCell;
    //     sourceInfo
    //     {
    //         p1      (0.000045 0.000105 0.000000);
    //         p2      (0.000045 0.000105 1.000000);
    //         radius  0.000015;
    //     }
    // }

    {
        name    boxCells;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
